Tekla.Structures.Datatype.StringConverter
The StringConverter class converts types to and from the string datatype.

Tekla.Structures.Datatype.StringConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the string datatype.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.StringConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the string datatype to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.StringConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the Tekla.Structures.Datatype.String type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new string datatype object.

Tekla.Structures.Datatype.StringConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the string datatype to the given destination type.
context: The context.
culture: The target culture.
value: The string datatype object to be converted.
destinationType: The destination type.
Returns: The given string datatype object converted to the new type.